mozolin/matter-thread/apps/mike_on_off/sdkconfig.defaults.esp32h2
CONFIG_IDF_TARGET="esp32h2"

# Enable OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

# Disable lwip ipv6 autoconfig
CONFIG_LWIP_IPV6_AUTOCONFIG=n

# LwIP config for OpenThread
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n

# Disable STA for ESP32H2
CONFIG_ENABLE_WIFI_STATION=n

# Plugs
CONFIG_NUM_VIRTUAL_PLUGS=8
CONFIG_GPIO_PLUG_1=0
CONFIG_GPIO_PLUG_2=1
CONFIG_GPIO_PLUG_3=2
CONFIG_GPIO_PLUG_4=3
CONFIG_GPIO_PLUG_5=5
CONFIG_GPIO_PLUG_6=10
CONFIG_GPIO_PLUG_7=11
CONFIG_GPIO_PLUG_8=12

# Serial JTag enebled
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
